emacs/settings.org
#+STARTUP: content
* Introduction

This file contains the configuration code for my emacs init file 
in *Linux*.

For it to work it requires the following code in the main emacs
file (init.el or emacs.el):

#+BEGIN_SRC
(require 'org)
(org-babel-load-file
 (expand-file-name "settings.org"
                   user-emacs-directory))
#+END_SRC

The example was obtained from a question posted in [[https://emacs.stackexchange.com/questions/3143/can-i-use-org-mode-to-structure-my-emacs-or-other-el-configuration-file?newreg=f5016c9f5ce5446e8cbf740c6a9dadd9][stackexchange]]. In
the post there are other arguments to take into account for the correct
usage of this method. So far it works well.

A good init file is the one of the youtuber [[https://gitlab.com/dwt1/dotfiles/-/blob/master/.emacs.d.gnu/config.org#org-mode][Darek Taylor]].
** Personal keybindings
   - *M-q* in <org-mode> ='toggle-truncate-lines=
   - *C-c a* in <org-mode> ='org-agenda=
   - *C-c `* in <markdown-mode> ='rmarkdown-new-chunk=
   - *C-x arrows*  =windmove-(up/right/left/down arrows)=
   - *C-x left/right*  =theme-looper-enable-= previous/next
   - *C-c t* <global> =load-themes=
   - *C-c p* =projectile-command-map=
   - A few others not recorded

* Emacs customization
** Emacs init
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(eval-when-compile 
  (add-to-list 'load-path "~/.emacs.d/elpa/")
  (require 'use-package))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(setq use-package-always-ensure t)

;; A diferentiation for termux
(setq tt/is-termux (string-match-p
		    (rx (* nonl) "com.termux" (* nonl))
		    (getenv "HOME")))
#+END_SRC

#+RESULTS:
: t

** Emacs config
#+BEGIN_SRC emacs-lisp
;; Stop the welcome screen
(setq inhibit-startup-screen t)
;; Hide toolbar
(tool-bar-mode -1)
;; Allows mark-type-delete
(delete-selection-mode t)

;; Starting file
(setq initial-buffer-choice
      (lambda ()
	(if (buffer-file-name)
	    (current-buffer)
	  (find-file "~/Code/personal_config/org/brujula.org"))))

;; enable column numbers
(setq column-number-mode t)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; show-paren-mode
(show-paren-mode 1)

;; Some interesting moving through buffers
(global-set-key (kbd "C-x <up>") 'windmove-up)
(global-set-key (kbd "C-x <down>") 'windmove-down)
(global-set-key (kbd "C-x <left>") 'windmove-left)
(global-set-key (kbd "C-x <right>") 'windmove-right)

;; Save bookmars upon adding each
(setq bookmark-save-flag 1)

;; always allow 'y' instead of 'yes'.
(setq use-short-answers t)

; default to utf-8 for all the things
(set-charset-priority 'unicode)
(setq locale-coding-system 'utf-8
      coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
;; (set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))

;; Backup files in ~/tmp/
(setq temporary-file-directory "~/tmp/")
(setq backup-directory-alist
          `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

;; Changelog on Linux systems
(if (eq system-type 'gnu/linux)
    (progn
      (setq add-log-full-name "Manuel Teodoro")
      (setq add-log-mailing-address "teotenn@proton.me")
      (setq change-log-default-name "CHANGELOG")))

(add-hook 'change-log-mode-hook
	  (lambda ()
	    (make-local-variable 'tab-width)
	    (make-local-variable 'left-margin)
	    (setq tab-width   2
		  left-margin 2)))

;; Shell warning indentation off
(advice-add 'sh-set-shell :around
            (lambda (orig-fun &rest args)
              (cl-letf (((symbol-function 'message) #'ignore))
                (apply orig-fun args))))
#+END_SRC

* Spell checking
** Flyspell
 #+BEGIN_SRC emacs-lisp
 ;; Dictionaries
 (use-package flyspell
   :defer t
   :if (eq system-type 'windows-nt)
   :init
   (setenv "DICPATH" (concat (getenv "HOME") "/Library/Spelling"))
   (setq ispell-program-name "C:\\Users\\teodorm3\\Bin\\Hunspell\\bin\\hunspell.exe"))

 (use-package flyspell
   :defer t
   :if (and (eq system-type 'gnu/linux)
	    (not tt/is-termux))
   :config
   (setq ispell-program-name "aspell"))

 (use-package flyspell
  :defer t
  :if tt/is-termux
  :config
  (setq ispell-program-name (executable-find "hunspell")))

 ;; Check on the go for all text-based modes (org, md, etc)
 (add-hook 'text-mode-hook 'flyspell-mode)
 (setq ispell-list-command "--list")
 #+END_SRC

* Magit
#+begin_src emacs-lisp
(use-package magit)
#+end_src
* Other packages
#+BEGIN_SRC emacs-lisp
    ;; load screenshot script
    ;; cloned from https://github.com/tecosaur/screenshot
    ;; Require pckgs <transient> and <posframe>
    (defun tt/load-screenshot()
      (interactive)
      (load "~/.emacs.d/scripts/screenshot.el"))

    ;; load highlight-symbol
    (defun tt/load-highlight-symbol()
      (interactive)
      (load "~/.emacs.d/scripts/highlight-symbol.el"))

    ;; Lisp interpreter (for slime and sly)
    ;; (use-package slime
    ;;   :if (eq system-type 'windows-nt)
    ;;   :ensure nil
    ;;   :disabled)

    ;; (use-package slime
    ;;   :if (eq system-type 'gnu/linux)
    ;;   :init
    ;;   (setq inferior-lisp-program "sbcl"))

    ;; rainbow-delimiters
    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode)
      :config
      (custom-set-faces
       '(rainbow-delimiters-depth-1-face ((t (:inherit rainbow-delimiters-base-face :foreground "blue3"))))
       '(rainbow-delimiters-depth-2-face ((t (:inherit rainbow-delimiters-base-face :foreground "chartreuse4"))))
       '(rainbow-delimiters-depth-3-face ((t (:inherit rainbow-delimiters-base-face :foreground "linen"))))
       '(rainbow-delimiters-depth-4-face ((t (:inherit rainbow-delimiters-base-face :foreground "chartreuse2"))))
       '(rainbow-delimiters-depth-5-face ((t (:inherit rainbow-delimiters-base-face :foreground "SteelBlue2"))))
       '(rainbow-delimiters-depth-6-face ((t (:inherit rainbow-delimiters-base-face :foreground "purple3"))))
       '(rainbow-delimiters-depth-7-face ((t (:inherit rainbow-delimiters-base-face :foreground "DimGray"))))
       '(rainbow-delimiters-depth-8-face ((t (:inherit rainbow-delimiters-base-face :foreground "bisque"))))))

    ;; yasnippet
(use-package yasnippet
  :init
  (setq yas-snippet-dirs
	'("~/.emacs.d/snippets"
	  "~/Code/dot_tt/emacs/snippets"
	  ))
  :config
  (yas-global-mode 1))

(use-package neotree)
(use-package htmlize)

(use-package all-the-icons
  :if (display-graphic-p))

(use-package imenu-list
  :bind (("C-c m" . imenu-list-smart-toggle))
  :config
  (setq imenu-list-focus-after-activation t))

(defun tt/wrap ()
  "Shortcut to open neotree directly on wrapper"
  (interactive)
  (if (eq system-type 'windows-nt)
      (neotree-dir "c:/Users/teodorm3/Documents/Wrapper")
    (message "tt/wrap is available only on Windows")))
#+END_SRC

* ESS and R
** ESS
#+BEGIN_SRC emacs-lisp
  ;; My lintr::linters
  (setq tt/lintr-linters
	"lintr::linters_with_defaults(
	   line_length_linter = line_length_linter(120),
           linters = object_name_linter(styles = c('dotted.case', 'lowercase', 'snake_case'))
	 )"
   )

  (use-package flymake
    :config
    (remove-hook 'flymake-diagnostic-functions 'flymake-proc-legacy-flymake))

  (use-package ess
    :if (eq system-type 'windows-nt)
    :init
    (setq ess-use-flymake nil)
    (setq inferior-ess-r-program "C:/Users/teodorm3/Bin/R-4.1.2/bin/R.exe"))

  (use-package ess
    :init
    (setq ess-style 'RStudio)
    :config
    (setq ess-r-flymake-linters tt/lintr-linters)
    (setq ess-eval-visibly-p t) ; ESS process (print all)
    (setq ess-ask-for-ess-directory nil)
    ;; Package manipulation
    ;; (setq ess-r-package-auto-enable-namespaced-evaluation nil)
    ;; R console hook
    (defun my-inferior-ess-init ()
      (setq-local ansi-color-for-comint-mode 'filter)
      (define-key inferior-ess-mode-map [\C-up]
	'comint-previous-matching-input-from-input)
      (define-key inferior-ess-mode-map [\C-down]
	'comint-next-matching-input-from-input)
      (define-key inferior-ess-mode-map [\C-x \t]
	'comint-dynamic-complete-filename))
    (add-hook 'inferior-ess-mode-hook 'my-inferior-ess-init)
    ;; Syntax highlight
    (setq ess-R-font-lock-keywords
	'((ess-R-fl-keyword:keywords . t)
	  (ess-R-fl-keyword:constants . t)
	  (ess-R-fl-keyword:modifiers . t)
	  (ess-R-fl-keyword:fun-defs . t)
	  (ess-R-fl-keyword:assign-ops . t)
	  (ess-R-fl-keyword:%op% . t)
	  (ess-fl-keyword:fun-calls . t)
	  (ess-fl-keyword:numbers . t)
	  (ess-fl-keyword:operators)
	  (ess-fl-keyword:delimiters)
	  (ess-fl-keyword:=)
	  (ess-R-fl-keyword:F&T . t)))
    )
#+END_SRC

