emacs/settings.org
** Flycheck
Documentation for [[https://lintr.r-lib.org/articles/lintr.html#the--lintr-file][the lintr "file"]]

And in general for [[https://lintr.r-lib.org/index.html][lintr]] and [[https://style.tidyverse.org/index.html][RStudio style guide]]
#+BEGIN_SRC emacs-lisp
;; Flycheck for syntax. Not global
;;(setq lintr-modifier-function "with_defaults(line_length_linter=NULL)")

;; (use-package flycheck
;;   :config
;;   (setq flycheck-lintr-linters tt/lintr-linters))

(use-package flycheck
  :if (eq system-type 'windows-nt)
  :init
  (setq flycheck-r-lintr-executable "C:\\Users\\teodorm3\\Bin\\R-4.2.1\\bin\\x64\\R.exe")
  :config
  (setq flycheck-lintr-linters "linters_with_defaults(line_length_linter = line_length_linter(120))"))
#+END_SRC

** R-markdown and quarto
 #+BEGIN_SRC emacs-lisp
  ;; R markdown
 (use-package polymode)
 (use-package poly-R)
 (use-package poly-markdown)
 (use-package quarto-mode)

 ;; MARKDOWN
 (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))

  ;; R modes
 (add-to-list 'auto-mode-alist '("\\.Snw" . poly-noweb+r-mode))
 (add-to-list 'auto-mode-alist '("\\.Rnw" . poly-noweb+r-mode))
 (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))
  ;;(autoload 'r-mode "ess-site" "(Autoload)" t)

 ;; Add chunk
 (defun rmarkdown-new-chunk (name)
   "Insert a new R chunk."
   (interactive "sChunk name: ")
   (insert "\n```{r " name "}\n")
   (save-excursion
     (newline)
     (insert "```\n")
     (previous-line)))
 ;; Map it to C-c `
 (define-key markdown-mode-map "\C-c`" 'rmarkdown-new-chunk)
 #+END_SRC

* Company (auto complete code)
#+BEGIN_SRC emacs-lisp
(use-package company
  :config
  ;; Turn on company-mode globally:
  (add-hook 'after-init-hook 'global-company-mode)
;; More customization options for company:
(setq company-selection-wrap-around t
      ;; Align annotations to the right tooltip border:
      company-tooltip-align-annotations t
      ;; Idle delay in seconds until completion starts automatically:
      company-idle-delay 0.45
      ;; Completion will start after typing two letters:
      company-minimum-prefix-length 3
      ;; Maximum number of candidates in the tooltip:
      company-tooltip-limit 10))

(use-package company-quickhelp
  :custom
  ;; Load company-quickhelp globally:
  (company-quickhelp-mode)
  ;; Time before display of documentation popup:
  (setq company-quickhelp-delay nil))

(eval-after-load 'company
  '(define-key company-active-map (kbd "C-c h") #'company-quickhelp-manual-begin))
#+END_SRC

* Org mode
** Base configuration

#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure nil
  :bind
  ("M-q" . toggle-truncate-lines)
  ("C-c a" . org-agenda)
  :config
  (setq org-agenda-files '("~/Code/personal_config/org/"))
  ;; Settags closer (default is -80)
  (setq org-tags-column -40)
  ;; src blocks
  (setq org-src-fontify-natively t
	org-src-window-setup 'current-window
	org-src-strip-leading-and-trailing-blank-lines t
	org-src-preserve-indentation t
	org-src-tab-acts-natively t)
  ;; org clock format
  (setq org-duration-format (quote h:mm))
  (setq org-ellipsis " ≫"))

;; --- ORG BABEL ---
(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (python . t)
   (emacs-lisp . t))
 )

(if (eq system-type 'gnu/linux)
    (setq org-babel-python-command "python3"))

(if (eq system-type 'windows-nt)
    (setq org-babel-R-command "C:/Users/teodorm3/Bin/R-4.2.1/bin/x64/R --slave --no-save"))
#+end_src

** Bullets
#+begin_src emacs-lisp
;; Bullets
(use-package org-bullets
  :config
  (setq org-bullets-bullet-list '("✙" "✤" "✚" "✜" "✛" "✢" "✣" "✥" "✠" "☥")))
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** org-tempo for templates
#+begin_src emacs-lisp
(use-package org-tempo
  :ensure nil
  :config
  ;; clocktable
  (add-to-list 'org-structure-template-alist '("CT" . ": clocktable :scope subtree :maxlevel 4 :block today"))
  ;; other
  ;; (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("p" . "src python"))
  (add-to-list 'org-structure-template-alist '("pexport" . "src python :session :results output :exports both"))
  (add-to-list 'org-structure-template-alist '("pnoeval" . "src python :exports code :eval no"))
  (add-to-list 'org-structure-template-alist '("phide" . "src python :session :exports none"))
  ;; elisp
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  ;; R
  (add-to-list 'org-structure-template-alist '("r" . "src R"))
  (add-to-list 'org-structure-template-alist '("rtibble" . "src R :session :results table :colnames yes :exports both"))
  (add-to-list 'org-structure-template-alist '("rplot" . "src R :session :file figure-N.png :results value graphics file :results output :exports both"))
  (add-to-list 'org-structure-template-alist '("rexport" . "src R :session :results output :exports both")))
#+END_SRC

** org-transclusion
#+begin_src emacs-lisp
(use-package org-transclusion)
#+end_src
* Python3
For elpy to work, it is necessary to install first jedi, either by =apt install python3-jedi= or =pip3 install jedi=.
Probably jedi is enough, however other python packages were installed in Sparky to ensure its functioning: eutopep8, flake8, importmagic and yapf

More on python on emacs [[https://realpython.com/emacs-the-best-python-editor/#emacs-for-python-development-with-elpy]]
#+BEGIN_SRC emacs-lisp
;;(setq python-shell-interpreter "python3")

(use-package elpy
  :if (eq system-type 'gnu/linux)
  :init
  (setq elpy-rpc-python-command "python3")
  :config
  (elpy-enable)
  (setq python-shell-interpreter "jupyter"
	python-shell-interpreter-args "console --simple-prompt"
	python-shell-prompt-detect-failure-warning nil)
  (add-to-list 'python-shell-completion-native-disabled-interpreters
               "jupyter"))

(use-package jedi)

;; Auto formatting help
;; Requires to install python "black"
;; Use it by calling M-x blacken-buffer
(use-package blacken)

;; Jupyter and iPython
(use-package ein
  :hook (ein:connect-mode-hook . ein:jedi-setup))
#+END_SRC

[[https://tkf.github.io/emacs-ipython-notebook/][ein documentation]] and a [[https://millejoh.github.io/emacs-ipython-notebook/][post on ein]]

* Fonts and themes
#+BEGIN_SRC emacs-lisp
;; doom-themes
(use-package all-the-icons)

(use-package alect-themes
  :config
  (load-theme 'alect-light t))

;; load a new theme unloading previous first 
(defun al/load-theme (theme)
  "Similar to `load-theme' except it unloads the current themes at first."
  (interactive
   (list (intern (completing-read
                  "Load custom theme: "
                  (mapcar #'symbol-name (custom-available-themes))))))
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme theme t)
  (message "Current theme: '%S'." theme))
#+END_SRC
* Auto complete emacs
** Ivy, Counsel and Smex 
 #+BEGIN_SRC emacs-lisp
   (use-package counsel
     :after ivy
     :config (counsel-mode))
   (use-package ivy
     :defer 0.1
     :diminish
     :bind
     (("C-c C-r" . ivy-resume)
      ("C-x B" . ivy-switch-buffer-other-window))
     :custom
     (setq ivy-count-format "(%d/%d) ")
     (setq ivy-use-virtual-buffers t)
     (setq enable-recursive-minibuffers t)
     :config
     (ivy-mode))

   (use-package swiper
     :after ivy
     :bind (("C-s" . swiper)
	    ("C-r" . swiper)))


   (setq ivy-initial-inputs-alist nil)

   (use-package smex)
   (smex-initialize)
 #+END_SRC

** Ivy post-frame
#+BEGIN_SRC emacs-lisp
(use-package ivy-posframe
  :init
  (setq ivy-posframe-display-functions-alist
    '((swiper                     . ivy-posframe-display-at-point)
      (complete-symbol            . ivy-posframe-display-at-point)
      (counsel-M-x                . ivy-display-function-fallback)
      (counsel-esh-history        . ivy-posframe-display-at-window-center)
      (counsel-describe-function  . ivy-display-function-fallback)
      (counsel-describe-variable  . ivy-display-function-fallback)
      (counsel-find-file          . ivy-display-function-fallback)
      (counsel-recentf            . ivy-display-function-fallback)
      (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
      (dmenu                      . ivy-posframe-display-at-frame-top-center)
      (nil                        . ivy-posframe-display))
    ivy-posframe-height-alist
    '((swiper . 20)
      (dmenu . 20)
      (t . 10)))
  :config
  (ivy-posframe-mode 1)) ; 1 enables posframe-mode, 0 disables it.
#+END_SRC

** which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :config
  (which-key-mode)) 
#+END_SRC
