emacs/settings.org
* mode line
#+BEGIN_SRC emacs-lisp
;; Function to beautify with all-the-icons package 
(defun custom-modeline-time ()
  (let* ((iweek (all-the-icons-octicon "calendar" 
				       :height 1.1 
				       :v-adjust -0.0 
				       :face 'all-the-icons-green))
	 (hour (string-to-number (format-time-string "%I"))))
    (concat
     (propertize iweek)
     (propertize (format-time-string "%W|%H:%M ") 'face `(:height 0.9)))))

;; Count (lines, words)
(defun custom-modeline-region-info ()
  (when mark-active
    (let ((words (count-lines (region-beginning) (region-end)))
          (chars (count-words (region-end) (region-beginning))))
      (concat
       (propertize (format "   %s" (all-the-icons-octicon "pencil") words chars)
                   'face `(:family ,(all-the-icons-octicon-family))
                   'display '(raise -0.0))
       (propertize (format " (%s, %s)" words chars)
                   'face `(:height 0.9))))))

;; version control NOT SO GOOD
(defun -custom-modeline-github-vc ()
  (let ((branch (mapconcat 'concat (cdr (split-string vc-mode "[:-]")) "-")))
    (concat
     (propertize (format " %s" (all-the-icons-alltheicon "git")) 
		 'display '(raise -0.1))
     " Â· "
     (propertize (format "%s" (all-the-icons-octicon "git-branch"))
                 'face `(:height 1.3 :family ,(all-the-icons-octicon-family))
                 'display '(raise -0.1))
     (propertize (format " %s" branch) 'face `(:height 0.9)))))

(defun -custom-modeline-svn-vc ()
  (let ((revision (cadr (split-string vc-mode "-"))))
    (concat
     (propertize (format " %s" (all-the-icons-faicon "cloud")) 'face `(:height 1.2) 'display '(raise -0.1))
     (propertize (format " Â· %s" revision) 'face `(:height 0.9)))))

(defun custom-modeline-icon-vc ()
  (when vc-mode
    (cond
      ((string-match "Git-" vc-mode) (-custom-modeline-github-vc))
      ((string-match "SVN-" vc-mode) (-custom-modeline-svn-vc))
      (t (format "%s" vc-mode)))))

;; -------------------- MODELINE -------------------- ;;
;; The formatter
(setq-default mode-line-format
      (list
	" "
	;; Buffer modified
	'(:eval (if (buffer-modified-p)
		    ;; Check icons with C-h v - all-the-icons-data
		    (propertize (all-the-icons-faicon "chain-broken" 
						      :height 1.1
						      :v-adjust -0.0 
						      :face 'all-the-icons-blue))
		  (propertize (all-the-icons-faicon "link"))))
	" "
	;;'custom-modeline-time
	'mode-line-position
	;; Buffer name
	"%b "
	;; Modes stay as they are, minions modify it
	'mode-line-modes
	;;'mode-line-misc-info
	'(:eval (custom-modeline-time))
	;; Version control 
	'(:eval (custom-modeline-icon-vc))
	;;'(vc-mode vc-mode)
	;; Marked region
	'(:eval (custom-modeline-region-info))
	))

;;; Hide modeline "lighters" (minions.el)
(use-package minions
  :config
  (setq minions-mode-line-lighter ";")
  ;; NOTE: This will be expanded whenever I find a mode that should not
  ;; be hidden
  (setq minions-prominent-modes
        (list 'defining-kbd-macro
              'flymake-mode))
  (minions-mode 1))


(use-package time
  :ensure nil
  :config
;; As we are using custom function for time, this is not needed any more
;;   (setq display-time-format "W%W %H:%M")
;;   ;;;; Covered by `display-time-format'
;;   ;; (setq display-time-24hr-format t)
;;   ;; (setq display-time-day-and-date t)
;;   (setq display-time-interval 120)
;;   (setq display-time-default-load-average nil)
;;   ;; ;; NOTE 2021-04-19: For all those, I have implemented a custom
;;   ;; ;; solution that also shows the number of new items.  Refer to my
;;   ;; ;; email settings, specifically `prot-mail-mail-indicator'.
;;   ;; ;;
;;   ;; ;; NOTE 2021-05-16: Or better check `prot-notmuch-mail-indicator'.
;;   (setq display-time-mail-directory nil)
;;   (setq display-time-mail-function nil)
;;   (setq display-time-use-mail-icon nil)
;;   (setq display-time-mail-string "")
;;   (setq display-time-mail-face nil)

;;; World clock
  (setq zoneinfo-style-world-list
	'(("America/Los_Angeles" "San Francisco")
          ("America/Mexico_City" "Mexico")
          ("America/New_York" "New York")
          ("Europe/Brussels" "Brussels")
	  ("Asia/Calcutta" "New Delhi")
          ("Asia/Tokyo" "Tokyo")))
  (setq display-time-world-list t)

  ;; All of the following variables are for Emacs 28
  ;; (setq world-clock-list t)
  ;; (setq world-clock-time-format "%R %z  %A %d %B")
  ;; (setq world-clock-buffer-name "*world-clock*") ; Placement handled by `display-buffer-alist'
  ;; (setq world-clock-timer-enable t)
  ;; (setq world-clock-timer-second 60)

  (add-hook 'after-init-hook #'display-time-mode))
#+END_SRC
* Shells
#+begin_src emacs-lisp
(use-package esh-autosuggest
  :hook (eshell-mode . esh-autosuggest-mode))
#+end_src
* Garbage collection
#+BEGIN_SRC emacs-lisp
;; Using garbage magic hack.
 (use-package gcmh
   :config
   (gcmh-mode 1))
;; Setting garbage collection threshold
(setq gc-cons-threshold 402653184
      gc-cons-percentage 0.6)

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; Silence compiler warnings as they can be pretty disruptive (setq comp-async-report-warnings-errors nil)
#+END_SRC

* Deprecated
Next is deprecated for now, but useful to keep
** Personal funcs
#+BEGIN_SRC example

;; Functions to auto save specific readme.org files into txt
(defun tt-copy-whole-buf ()
  "Selects and copies the entire buffer"
  (kill-ring-save (push-mark (point))
		  (push-mark (point-max) nil t)
		  (goto-char (point-min))))


(defun tt-make-txt (path-for-txt txt-file)
  "Copies the active buffer and creates a txt file
with the yank text. The file is stored in the </path/for/txt/> 
folder, <txt-file.txt> file"
  (interactive)
  (let ((saved-from-org (tt-copy-whole-buf)))
    (find-file (concat path-for-txt txt-file))
    (switch-to-buffer txt-file)
    (erase-buffer)
    (yank)
    (save-buffer)
    (kill-buffer txt-file)))

;; Add hook for only /mnt/teodoro/Archivos/PI/AR/README.org when saving
;; To create a txt file
(add-hook 'before-save-hook
	  (lambda ()
	    (when ;(string= (file-truename "README.org") (file-truename (buffer-file-name))) ; For all readme.org
		(string= (file-truename "/mnt/teodoro/Archivos/PI/AR/README.org")
			 (file-truename (buffer-file-name))) ; works
		;(string= (file-name-directory buffer-file-name) "/mnt/teodoro/Archivos/PI/AR/") ; works
	      (tt-make-txt (file-name-directory buffer-file-name) "README.txt"))))

;; Hook to create the md file and the timestamp
(add-hook 'before-save-hook
	  (lambda ()
	    (when 
		(string= (file-truename "/mnt/teodoro/Archivos/PI/AR/README.org")
			 (file-truename (buffer-file-name)))
	      (time-stamp)
	      (org-md-export-to-markdown))))
#+END_SRC
  
** modus themes
 #+BEGIN_SRC
 ;; modus-themes
 (require 'modus-themes)

 ;; Add all your customizations prior to loading the themes
 (setq modus-themes-italic-constructs nil
       modus-themes-bold-constructs t
       modus-themes-subtle-line-numbers t
       modus-themes-deuteranopia t
       modus-themes-tabs-accented t
       modus-themes-variable-pitch-ui nil
       modus-themes-variable-pitch-headings nil
       modus-themes-inhibit-reload t)

 (setq modus-themes-lang-checkers '(background text-also)
       modus-themes-mode-line '(accented borderless padded)
       ;; org and markdown code
       modus-themes-markup '(intense background)
       modus-themes-syntax '(alt-syntax)
       modus-themes-paren-match '(bold intense)
       modus-themes-links '(neutral-underline faint italic)
       modus-themes-region '(bg-only accented)
       modus-themes-prompts '(intense bold))

 (setq modus-themes-headings
       '((1 . (bold rainbow overline 1.3))
         (2 . (semibold rainbow 1.2))
         (3 . (light rainbow 1.1))
         (t . (light rainbow))))

 ;; Load the theme files before enabling a theme
 (modus-themes-load-themes)

 ;; Load the theme of your choice:
 (modus-themes-load-operandi) ;; OR (modus-themes-load-vivendi)

 (define-key global-map (kbd "C-c t") #'modus-themes-toggle)
 #+END_SRC
** Other collected
#+BEGIN_SRC
;; STARTUP BUFFER FILE 
;; This will only open ONLY the selected file BUT no workflow.
  (setq initial-buffer-choice
	(lambda ()
	  (if (buffer-file-name)
	      (current-buffer) ;; leave as-is
	    (find-file "~/Code/personal_config/brujula.org"))))

;; R IN RScript style (it crashes init file)
;; ESS Indentation
(add-hook 'find-file-hook 'tt-r-style-hook)
(defun tt-r-style-hook ()
  (when (string-match (file-name-extension buffer-file-name) "[r|R]$")
    (ess-set-style 'RStudio)))

(setq ess-R-font-lock-keywords
      '((ess-fl-keyword:fun-calls . t)
	(ess-fl-keyword:numbers . t)))
#+END_SRC
** My move-to-file functions
Deprecated when I learned to work with bookmarks
 #+BEGIN_SRC
 ;; Teoten (tt) functions -------------------->
 ;;; Here is my own attempt to create useful functions

 (defun tt-h ()
     "Shortcut to move to my emacs-home-buffer
      for orientation. It switch to brujula.org
      if it's already open, or opens the file if not"
     (interactive)
	(if (get-buffer "brujula.org")
            (switch-to-buffer "brujula.org")
            (find-file "~/Code/personal_config/org/brujula.org")))

 (defun tt-d ()
     "Shortcut to move to my emacs-RWD-buffer
      for personal projects. It switch to rwd.org
      if it's already open, or opens the file if not"
     (interactive)
	(if (get-buffer "rwd.org")
            (switch-to-buffer "rwd.org")
            (find-file "~/Code/rwd.org")))

 (defun tt-w ()
     "Shortcut to move to my emacs-workflow-buffer
      for profesional work. It switch to workflow.org
      if it's already open, or opens the file if not"
     (interactive)
	(if (get-buffer "workflow.org")
	    (switch-to-buffer "workflow.org")
	    (find-file "~/Code/personal_config/org/workflow.org")))

 (defun tt-b ()
     "Shortcut to move to the dashboard"
     (interactive)
     (switch-to-buffer "*dashboard*"))
 #+END_SRC

