emacs/settings.el

;; Function to beautify with all-the-icons package 
(defun custom-modeline-time ()
  (let* ((iweek (all-the-icons-octicon "calendar" 
				       :height 1.1 
				       :v-adjust -0.0 
				       :face 'all-the-icons-green))
	 (hour (string-to-number (format-time-string "%I"))))
    (concat
     (propertize iweek)
     (propertize (format-time-string "%W|%H:%M ") 'face `(:height 0.9)))))

;; Count (lines, words)
(defun custom-modeline-region-info ()
  (when mark-active
    (let ((words (count-lines (region-beginning) (region-end)))
          (chars (count-words (region-end) (region-beginning))))
      (concat
       (propertize (format "   %s" (all-the-icons-octicon "pencil") words chars)
                   'face `(:family ,(all-the-icons-octicon-family))
                   'display '(raise -0.0))
       (propertize (format " (%s, %s)" words chars)
                   'face `(:height 0.9))))))

;; version control NOT SO GOOD
(defun -custom-modeline-github-vc ()
  (let ((branch (mapconcat 'concat (cdr (split-string vc-mode "[:-]")) "-")))
    (concat
     (propertize (format " %s" (all-the-icons-alltheicon "git")) 
		 'display '(raise -0.1))
     " Â· "
     (propertize (format "%s" (all-the-icons-octicon "git-branch"))
                 'face `(:height 1.3 :family ,(all-the-icons-octicon-family))
                 'display '(raise -0.1))
     (propertize (format " %s" branch) 'face `(:height 0.9)))))

(defun -custom-modeline-svn-vc ()
  (let ((revision (cadr (split-string vc-mode "-"))))
    (concat
     (propertize (format " %s" (all-the-icons-faicon "cloud")) 'face `(:height 1.2) 'display '(raise -0.1))
     (propertize (format " Â· %s" revision) 'face `(:height 0.9)))))

(defun custom-modeline-icon-vc ()
  (when vc-mode
    (cond
      ((string-match "Git-" vc-mode) (-custom-modeline-github-vc))
      ((string-match "SVN-" vc-mode) (-custom-modeline-svn-vc))
      (t (format "%s" vc-mode)))))

;; -------------------- MODELINE -------------------- ;;
;; The formatter
(setq-default mode-line-format
      (list
	" "
	;; Buffer modified
	'(:eval (if (buffer-modified-p)
		    ;; Check icons with C-h v - all-the-icons-data
		    (propertize (all-the-icons-faicon "chain-broken" 
						      :height 1.1
						      :v-adjust -0.0 
						      :face 'all-the-icons-blue))
		  (propertize (all-the-icons-faicon "link"))))
	" "
	;;'custom-modeline-time
	'mode-line-position
	;; Buffer name
	"%b "
	;; Modes stay as they are, minions modify it
	'mode-line-modes
	;;'mode-line-misc-info
	'(:eval (custom-modeline-time))
	;; Version control 
	'(:eval (custom-modeline-icon-vc))
	;;'(vc-mode vc-mode)
	;; Marked region
	'(:eval (custom-modeline-region-info))
	))

;;; Hide modeline "lighters" (minions.el)
(use-package minions
  :config
  (setq minions-mode-line-lighter ";")
  ;; NOTE: This will be expanded whenever I find a mode that should not
  ;; be hidden
  (setq minions-prominent-modes
        (list 'defining-kbd-macro
              'flymake-mode))
  (minions-mode 1))


(use-package time
  :ensure nil
  :config
;; As we are using custom function for time, this is not needed any more
;;   (setq display-time-format "W%W %H:%M")
;;   ;;;; Covered by `display-time-format'
;;   ;; (setq display-time-24hr-format t)
;;   ;; (setq display-time-day-and-date t)
;;   (setq display-time-interval 120)
;;   (setq display-time-default-load-average nil)
;;   ;; ;; NOTE 2021-04-19: For all those, I have implemented a custom
;;   ;; ;; solution that also shows the number of new items.  Refer to my
;;   ;; ;; email settings, specifically `prot-mail-mail-indicator'.
;;   ;; ;;
;;   ;; ;; NOTE 2021-05-16: Or better check `prot-notmuch-mail-indicator'.
;;   (setq display-time-mail-directory nil)
;;   (setq display-time-mail-function nil)
;;   (setq display-time-use-mail-icon nil)
;;   (setq display-time-mail-string "")
;;   (setq display-time-mail-face nil)

;;; World clock
  (setq zoneinfo-style-world-list
	'(("America/Los_Angeles" "San Francisco")
          ("America/Mexico_City" "Mexico")
          ("America/New_York" "New York")
          ("Europe/Brussels" "Brussels")
	  ("Asia/Calcutta" "New Delhi")
          ("Asia/Tokyo" "Tokyo")))
  (setq display-time-world-list t)

  ;; All of the following variables are for Emacs 28
  ;; (setq world-clock-list t)
  ;; (setq world-clock-time-format "%R %z  %A %d %B")
  ;; (setq world-clock-buffer-name "*world-clock*") ; Placement handled by `display-buffer-alist'
  ;; (setq world-clock-timer-enable t)
  ;; (setq world-clock-timer-second 60)

  (add-hook 'after-init-hook #'display-time-mode))

;; Using garbage magic hack.
 (use-package gcmh
   :config
   (gcmh-mode 1))
;; Setting garbage collection threshold
(setq gc-cons-threshold 402653184
      gc-cons-percentage 0.6)

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; Silence compiler warnings as they can be pretty disruptive (setq comp-async-report-warnings-errors nil)
